---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForCeiling
source: html/b6298765-5843-d52f-0025-7771452a42e3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForCeiling Property

Ceiling sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchForCeiling { get; }
```